GopalSaraf/Practicals/PSDL/include/proc/pic16f506.inc
// Register: ADRES
#define ADRES ADRES
ADRES                                    equ 000Ah
// bitfield definitions
ADRES_ADRES_POSN                         equ 0000h
ADRES_ADRES_POSITION                     equ 0000h
ADRES_ADRES_SIZE                         equ 0008h
ADRES_ADRES_LENGTH                       equ 0008h
ADRES_ADRES_MASK                         equ 00FFh

// Register: CM2CON0
#define CM2CON0 CM2CON0
CM2CON0                                  equ 000Bh
// bitfield definitions
CM2CON0_nC2WU_POSN                       equ 0000h
CM2CON0_nC2WU_POSITION                   equ 0000h
CM2CON0_nC2WU_SIZE                       equ 0001h
CM2CON0_nC2WU_LENGTH                     equ 0001h
CM2CON0_nC2WU_MASK                       equ 0001h
CM2CON0_C2PREF1_POSN                     equ 0001h
CM2CON0_C2PREF1_POSITION                 equ 0001h
CM2CON0_C2PREF1_SIZE                     equ 0001h
CM2CON0_C2PREF1_LENGTH                   equ 0001h
CM2CON0_C2PREF1_MASK                     equ 0002h
CM2CON0_C2NREF_POSN                      equ 0002h
CM2CON0_C2NREF_POSITION                  equ 0002h
CM2CON0_C2NREF_SIZE                      equ 0001h
CM2CON0_C2NREF_LENGTH                    equ 0001h
CM2CON0_C2NREF_MASK                      equ 0004h
CM2CON0_C2ON_POSN                        equ 0003h
CM2CON0_C2ON_POSITION                    equ 0003h
CM2CON0_C2ON_SIZE                        equ 0001h
CM2CON0_C2ON_LENGTH                      equ 0001h
CM2CON0_C2ON_MASK                        equ 0008h
CM2CON0_C2PREF2_POSN                     equ 0004h
CM2CON0_C2PREF2_POSITION                 equ 0004h
CM2CON0_C2PREF2_SIZE                     equ 0001h
CM2CON0_C2PREF2_LENGTH                   equ 0001h
CM2CON0_C2PREF2_MASK                     equ 0010h
CM2CON0_C2POL_POSN                       equ 0005h
CM2CON0_C2POL_POSITION                   equ 0005h
CM2CON0_C2POL_SIZE                       equ 0001h
CM2CON0_C2POL_LENGTH                     equ 0001h
CM2CON0_C2POL_MASK                       equ 0020h
CM2CON0_nC2OUTEN_POSN                    equ 0006h
CM2CON0_nC2OUTEN_POSITION                equ 0006h
CM2CON0_nC2OUTEN_SIZE                    equ 0001h
CM2CON0_nC2OUTEN_LENGTH                  equ 0001h
CM2CON0_nC2OUTEN_MASK                    equ 0040h
CM2CON0_C2OUT_POSN                       equ 0007h
CM2CON0_C2OUT_POSITION                   equ 0007h
CM2CON0_C2OUT_SIZE                       equ 0001h
CM2CON0_C2OUT_LENGTH                     equ 0001h
CM2CON0_C2OUT_MASK                       equ 0080h

// Register: VRCON
#define VRCON VRCON
VRCON                                    equ 000Ch
// bitfield definitions
VRCON_VR_POSN                            equ 0000h
VRCON_VR_POSITION                        equ 0000h
VRCON_VR_SIZE                            equ 0004h
VRCON_VR_LENGTH                          equ 0004h
VRCON_VR_MASK                            equ 000Fh
VRCON_VRR_POSN                           equ 0005h
VRCON_VRR_POSITION                       equ 0005h
VRCON_VRR_SIZE                           equ 0001h
VRCON_VRR_LENGTH                         equ 0001h
VRCON_VRR_MASK                           equ 0020h
VRCON_VROE_POSN                          equ 0006h
VRCON_VROE_POSITION                      equ 0006h
VRCON_VROE_SIZE                          equ 0001h
VRCON_VROE_LENGTH                        equ 0001h
VRCON_VROE_MASK                          equ 0040h
VRCON_VREN_POSN                          equ 0007h
VRCON_VREN_POSITION                      equ 0007h
VRCON_VREN_SIZE                          equ 0001h
VRCON_VREN_LENGTH                        equ 0001h
VRCON_VREN_MASK                          equ 0080h
VRCON_VR0_POSN                           equ 0000h
VRCON_VR0_POSITION                       equ 0000h
VRCON_VR0_SIZE                           equ 0001h
VRCON_VR0_LENGTH                         equ 0001h
VRCON_VR0_MASK                           equ 0001h
VRCON_VR1_POSN                           equ 0001h
VRCON_VR1_POSITION                       equ 0001h
VRCON_VR1_SIZE                           equ 0001h
VRCON_VR1_LENGTH                         equ 0001h
VRCON_VR1_MASK                           equ 0002h
VRCON_VR2_POSN                           equ 0002h
VRCON_VR2_POSITION                       equ 0002h
VRCON_VR2_SIZE                           equ 0001h
VRCON_VR2_LENGTH                         equ 0001h
VRCON_VR2_MASK                           equ 0004h
VRCON_VR3_POSN                           equ 0003h
VRCON_VR3_POSITION                       equ 0003h
VRCON_VR3_SIZE                           equ 0001h
VRCON_VR3_LENGTH                         equ 0001h
VRCON_VR3_MASK                           equ 0008h

// Register: TRISB
#define TRISB TRISB

// Register: TRISC
#define TRISC TRISC

/*
 * Bit Access Macros
 */

#ifndef PAGEMASK
#define PAGEMASK(addr) ((addr) and 01FFh)
#endif
#ifndef BANKMASK
#define BANKMASK(addr) ((addr) and 01Fh)
#endif
#define ADCS0                            BANKMASK(ADCON0), 4
#define ADCS1                            BANKMASK(ADCON0), 5
#define ADON                             BANKMASK(ADCON0), 0
#define ANS0                             BANKMASK(ADCON0), 6
#define ANS1                             BANKMASK(ADCON0), 7
#define C1NREF                           BANKMASK(CM1CON0), 2
#define C1ON                             BANKMASK(CM1CON0), 3
#define C1OUT                            BANKMASK(CM1CON0), 7
#define C1POL                            BANKMASK(CM1CON0), 5
#define C1PREF                           BANKMASK(CM1CON0), 1
#define C2NREF                           BANKMASK(CM2CON0), 2
#define C2ON                             BANKMASK(CM2CON0), 3
#define C2OUT                            BANKMASK(CM2CON0), 7
#define C2POL                            BANKMASK(CM2CON0), 5
#define C2PREF1                          BANKMASK(CM2CON0), 1
#define C2PREF2                          BANKMASK(CM2CON0), 4
#define CAL0                             BANKMASK(OSCCAL), 1
#define CAL1                             BANKMASK(OSCCAL), 2
#define CAL2                             BANKMASK(OSCCAL), 3
#define CAL3                             BANKMASK(OSCCAL), 4
#define CAL4                             BANKMASK(OSCCAL), 5
#define CAL5                             BANKMASK(OSCCAL), 6
#define CAL6                             BANKMASK(OSCCAL), 7
#define CARRY                            BANKMASK(STATUS), 0
#define CHS0                             BANKMASK(ADCON0), 2
#define CHS1                             BANKMASK(ADCON0), 3
#define CWUF                             BANKMASK(STATUS), 6
#define DC                               BANKMASK(STATUS), 1
#define GO                               BANKMASK(ADCON0), 1
#define GO_nDONE                         BANKMASK(ADCON0), 1
#define PA0                              BANKMASK(STATUS), 5
#define RB0                              BANKMASK(PORTB), 0
#define RB1                              BANKMASK(PORTB), 1
#define RB2                              BANKMASK(PORTB), 2
#define RB3                              BANKMASK(PORTB), 3
#define RB4                              BANKMASK(PORTB), 4
#define RB5                              BANKMASK(PORTB), 5
#define RBWUF                            BANKMASK(STATUS), 7
#define RC0                              BANKMASK(PORTC), 0
#define RC1                              BANKMASK(PORTC), 1
#define RC2                              BANKMASK(PORTC), 2
#define RC3                              BANKMASK(PORTC), 3
#define RC4                              BANKMASK(PORTC), 4
#define RC5                              BANKMASK(PORTC), 5
#define VR0                              BANKMASK(VRCON), 0
#define VR1                              BANKMASK(VRCON), 1
#define VR2                              BANKMASK(VRCON), 2
#define VR3                              BANKMASK(VRCON), 3
#define VREN                             BANKMASK(VRCON), 7
#define VROE                             BANKMASK(VRCON), 6
#define VRR                              BANKMASK(VRCON), 5
#define ZERO                             BANKMASK(STATUS), 2
#define nC1OUTEN                         BANKMASK(CM1CON0), 6
#define nC1T0CS                          BANKMASK(CM1CON0), 4
#define nC1WU                            BANKMASK(CM1CON0), 0
#define nC2OUTEN                         BANKMASK(CM2CON0), 6
#define nC2WU                            BANKMASK(CM2CON0), 0
#define nDONE                            BANKMASK(ADCON0), 1
#define nPD                              BANKMASK(STATUS), 3
#define nTO                              BANKMASK(STATUS), 4

/*
 * Device Psects
 */

#ifdef _XC_INC_

// Memory Spaces
#define SPACE_CODE   0
#define SPACE_DATA   1
#define SPACE_EEPROM 3

psect udata_shr,class=COMMON,space=SPACE_DATA,noexec
psect udata,class=RAM,space=SPACE_DATA,noexec
psect udata_bank0,class=BANK0,space=SPACE_DATA,noexec
psect udata_bank1,class=BANK1,space=SPACE_DATA,noexec
psect udata_bank2,class=BANK2,space=SPACE_DATA,noexec
psect udata_bank3,class=BANK3,space=SPACE_DATA,noexec
psect code,class=CODE,space=SPACE_CODE,delta=2
psect data,class=STRCODE,space=SPACE_CODE,delta=2,noexec

#endif // _XC_INC_

#endif // _PIC16F506_INC_
